{"inkVersion":20,"root":[["\n","\n","\n","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"Mentor":["^O bagulho eh doido!","\n","^E o processo eh lento!","\n","done",{"J2_1":["^Eu não estarei aqui no jogo final. Só vou te guiar em algumas coisas nesse protótipo.","\n","^Os controles são os seguintes:","\n","^W e D para se mover.","\n","^Espaço para pular. Quanto mais segurar, mais alto é o pulo.","\n","^Por enquanto é isso.","\n","done",{"#f":1}],"J2_2":["^AVISO DO PROGRAMADOR: Não entre aqui.","\n","^É bem provável que o jogo trave.","\n","^Mas você que sabe...","\n","^...","\n","^Sim, eu podia ter só fechado a passagem.","\n","^Mas aí não teria graça nenhuma.","\n","done",{"#f":1}],"J2_3":["^AVISO DO PROGRAMADOR: Esse diálogo não é o final, mas esse personagem realmente é introduzido nessa parte do jogo.","\n","^Salve!","\n","^Agora eu vou te passar as manha.","\n","^Aperta o botão direito do mouse pra ativar o escudo.","\n","^O escudo pode tomar 3 ataques, depois disso ele vai de base e tem que esperar um tempo pra recarregar.","\n","^O botao esquerdo do mouse é o parry, com ele vc pode rebater ataques pra direção que estiver apontando.","\n","^Se você acertar o parry, tbm vai absorver a energia do ataque que rebateu.","\n","^Aí é só apertar R pra usar a habilidade do elemento absorvido.","\n","^Além disso, se você dar parry em um ataque vindo de baixo, vai ganhar um impulso pra cima.","\n","^Lá embaixo tem um inimigo, é uma boa testar com ele.","\n","done",{"#f":1}],"J2_4":["^Aqui é a primeira cidade do jogo, embora não tenha nada.","\n","^Não precisa nem seguir pra direita, realmente não tem nada. O caminho é subindo essas plataformas.","\n","^Seu objetivo é ir até o Ancião da Natureza pra trocar uma ideia com ele.","\n","done",{"#f":1}],"J2_4_1":[["ev",{"CNT?":"Mentor.J2_4"},"/ev",{"->":".^.b","c":true},{"b":["\n","^Curioso vc hein.","\n","^Não tem nada mesmo pra cá, não deu tempo de implementar :(","\n",{"->":".^.^.^.2"},null]}],[{"->":".^.b"},{"b":["\n","^Não tem nada pra cá, não deu tempo de implementar :(","\n",{"->":".^.^.^.2"},null]}],"nop","\n","done",{"#f":1}],"J2_5":["^Se você não estiver vendo, espera aqui até aparecer uma plataforma.","\n","done",{"#f":1}],"J2_6":["^Parabéns, você chegou no final do protótipo.","\n","^Não tem mais muito o que fazer.","\n","^Se quiser voltar e explorar um pouco.","\n","^Se achar algum bug, por favor avise.","\n","^É nois!","\n","done",{"#f":1}],"#f":1}],"Adventurer":["^Adventurer!","\n","done",{"#f":1}],"Storyteller":["^Storyteller!","\n","done",{"#f":1}],"Merchant":["^Merchant!","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}